nowhard/STM32_PILORAMA/freertos_test/protocols/proto.c
   	}
   //-----------------------------------------------------------------------------------------------------------------
   	if(USART_GetITStatus(USART_RS485, USART_IT_TC) != RESET)
   	{

   		USART_ClearITPendingBit(USART_RS485, USART_IT_TC);

   		if(transf_count<buf_len)
   		{
   			if(transf_count<3)
   			{
   				//USART_SendData(USART_RS485,TransferBuf[transf_count]);
   				USART_RS485->DR =TransferBuf[transf_count];
   				transf_count++;
   			}
   			else
   			{
   					if(CUT_OUT_NULL==0)
   					{
   						if(TransferBuf[transf_count]==(uint8_t)0xD7)
   						{
   							CUT_OUT_NULL=0x1;
   						}
   						//USART_SendData(USART_RS485,TransferBuf[transf_count]);
   						USART_RS485->DR =TransferBuf[transf_count];
   						transf_count++;
   					}
   					else
   					{
   						//USART_SendData(USART_RS485,(uint8_t)0x0);
   						USART_RS485->DR =(uint8_t)0x0 ;
   						CUT_OUT_NULL=0;
   					}
   			}
   		}
   		else
   		{
   			transf_count=0;
   			recieve_count=0;

   			CUT_OUT_NULL=0;
   			USART_ITConfig(USART_RS485, USART_IT_RXNE , ENABLE);
   			RS_485_RECEIVE;
   		}

   	}
   	portEND_SWITCHING_ISR( xHigherPriorityTaskWoken );
}
//------------------------------------------------------------------------------
void Proto_Init(uint8_t init_type) //
{
		GPIO_InitTypeDef GPIO_InitStruct; // this is for the GPIO pins used as TX and RX
		USART_InitTypeDef USART_InitStruct; // this is for the USART_RS485 initilization
		NVIC_InitTypeDef NVIC_InitStructure; // this is used to configure the NVIC (nested vector interrupt controller)

		RCC_APB1PeriphClockCmd(RCC_USART_RS485, ENABLE);
		RCC_AHB1PeriphClockCmd(RCC_USART_RS485_GPIO, ENABLE);

		GPIO_InitStruct.GPIO_Pin = USART_RS485_TXD | USART_RS485_RXD; // Pins  (TX) and (RX) are used
		GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF; 			// the pins are configured as alternate function so the USART peripheral has access to them
		GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;		// this defines the IO speed and has nothing to do with the baudrate!
		GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;			// this defines the output type as push pull mode (as opposed to open drain)
		GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_UP;			// this activates the pullup resistors on the IO pins
		GPIO_Init(USART_RS485_GPIO, &GPIO_InitStruct);					// now all the values are passed to the GPIO_Init() function which sets the GPIO registers

		GPIO_PinAFConfig(USART_RS485_GPIO, USART_RS485_TXD_PIN_SOURCE, GPIO_AF_USART_RS485); //
		GPIO_PinAFConfig(USART_RS485_GPIO, USART_RS485_RXD_PIN_SOURCE, GPIO_AF_USART_RS485);

		USART_InitStruct.USART_BaudRate = 57600;				// the baudrate is set to the value we passed into this init function
		USART_InitStruct.USART_WordLength = USART_WordLength_8b;// we want the data frame size to be 8 bits (standard)
		USART_InitStruct.USART_StopBits = USART_StopBits_1;		// we want 1 stop bit (standard)
		USART_InitStruct.USART_Parity = USART_Parity_No;		// we don't want a parity bit (standard)
		USART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None; // we don't want flow control (standard)
		USART_InitStruct.USART_Mode = USART_Mode_Tx | USART_Mode_Rx; // we want to enable the transmitter and the receiver
		USART_Init(USART_RS485, &USART_InitStruct);					// again all the properties are passed to the USART_Init function which takes care of all the bit setting

	    GPIO_InitStruct.GPIO_Pin   = USART_RS485_DE|USART_RS485_RE;
	    GPIO_InitStruct.GPIO_Mode  = GPIO_Mode_OUT;
	    GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	    GPIO_InitStruct.GPIO_PuPd =  GPIO_PuPd_NOPULL;
	    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	    GPIO_Init(USART_RS485_GPIO, &GPIO_InitStruct);

		USART_ClearFlag(USART_RS485, USART_FLAG_CTS | USART_FLAG_LBD  | USART_FLAG_TC  | USART_FLAG_RXNE );


		USART_ITConfig(USART_RS485, USART_IT_TC, ENABLE);
		USART_ITConfig(USART_RS485, USART_IT_RXNE , ENABLE);

		USART_Cmd(USART_RS485, ENABLE);

		NVIC_PriorityGroupConfig( NVIC_PriorityGroup_4 );

		   /* Enabling interrupt from USART */
		NVIC_InitStructure.NVIC_IRQChannel = USART_RS485_IRQn;
		NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 14;
		NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
		NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
		NVIC_Init(&NVIC_InitStructure);



		NVIC_EnableIRQ(USART_RS485_IRQn);						 // the properties are passed to the NVIC_Init function which takes care of the low level stuff



	RS_485_RECEIVE;


	crc_n_ERR=0x0;	//
	COMMAND_ERR=0x0;//


	TransferBuf=&tab.uart_buf;
	RecieveBuf= &tab.uart_buf;
	ChannelsInit();

	recieve_count=0x0;//
	transf_count=0x0;//
	buf_len=0x0;//

	CUT_OUT_NULL=0;
	PROTO_HAS_START=0;

	if(init_type==PROTO_FIRST_INIT)
	{
		xTaskCreate(ProtoProcess,(signed char*)"PROTO",128,NULL, tskIDLE_PRIORITY + 1, NULL);
		task_watches[PROTO_TASK].task_status=TASK_ACTIVE;
		vSemaphoreCreateBinary( xProtoSemaphore );
	}
	return;
}
//-----------------------------------------------------------------------------
uint8_t Send_Info(void) //
{
	   uint8_t    i=0;

	   TransferBuf[0]=0x00;
	   TransferBuf[1]=0xD7;
	   TransferBuf[2]=0x29;
	   //------------------
	   TransferBuf[3]=ADRESS_DEV;  //
	   TransferBuf[4]=GET_DEV_INFO_RESP;  //
	   TransferBuf[6]=STATE_BYTE;

	   for(i=0;i<20;i++)
	   {				  //
		   if(i<DEVICE_NAME_LENGTH_SYM)
		   {
				TransferBuf[i+7]=DEV_NAME[i];
		   }
		   else
		   {
				TransferBuf[i+7]=0x00;
		   }
	   }

	   for(i=0;i<5;i++)                   //
	   {
	       if(i<DEVICE_VER_LENGTH_SYM)
		   {
		    	 TransferBuf[i+27]=VERSION[i];
		   }
	   }

	   TransferBuf[32]=CHANNEL_NUMBER;

	   for(i=0;i<CHANNEL_NUMBER;i++)
       {
		  	TransferBuf[i*2+33]=((channels[i].settings.set.type)<<4)|channels[i].settings.set.modific; //
		  	TransferBuf[i*2+33+1]=0x00;
	   }
	   for(i=0;i<dev_desc_len;i++)
	   {
			 TransferBuf[i+33+CHANNEL_NUMBER*2]=NOTICE[i];
	   }

	   TransferBuf[5]=28+CHANNEL_NUMBER*2+dev_desc_len;
	   TransferBuf[33+CHANNEL_NUMBER*2+dev_desc_len]=CRC_Check(&TransferBuf[1],32+CHANNEL_NUMBER*2+dev_desc_len); //

	return (34+CHANNEL_NUMBER*2+dev_desc_len);
}
//-----------------------------------------------------------------------------
uint8_t Node_Full_Init(void) //
{
	return 0;
}
//-----------------------------------------------------------------------------
uint8_t Channel_List_Init(void) //
{
	return 0;
}
//-----------------------------------------------------------------------------
uint8_t Channel_Get_Data(void) //
{
	return 0;
}
//-----------------------------------------------------------------------------
uint8_t  Channel_Set_Parameters(void) //
{
	 uint8_t index=0, store_data=0;
	 uint8_t len=0,i=0;

	   while(index<(RecieveBuf[5]-1))				   //
	      {
			  	if(RecieveBuf[6+index]<CHANNEL_NUMBER)
			    {
					switch((RecieveBuf[6+index+1]>>4)&0xF)
					{
//					 		case CHNL_ADC://Р В Р’В Р РЋРІР‚в„ўР В Р’В Р вЂ™Р’В¦Р В Р’В Р РЋРЎСџ
//							{
//								if((channels[RecieveBuf[6+index]].settings.set.modific!=RecieveBuf[6+index+1])||(channels[RecieveBuf[6+index]].settings.set.state_byte_1!=RecieveBuf[6+index+2]) || (channels[RecieveBuf[6+index]].settings.set.state_byte_2!=RecieveBuf[6+index+3]))
//								{
//									channels[RecieveBuf[6+index]].settings.set.state_byte_1=RecieveBuf[6+index+2];
//									channels[RecieveBuf[6+index]].settings.set.state_byte_2=RecieveBuf[6+index+3];
//									channels[RecieveBuf[6+index]].settings.set.modific	   =RecieveBuf[6+index+1]&0xF;
//									//debug----------------
//									//if(channels[RecieveBuf[6+index]].settings.set.modific==3)
////									{
////										GPIOC->ODR |= GPIO_Pin_8;
////									}
//									//-----------------
//									store_data=1;
//
//								}
//								index=index+1;
//							}
//							break;

//							case 0x2://Р В Р Р‹Р Р†Р вЂљР Р‹Р В Р’В Р вЂ™Р’В°Р В Р Р‹Р В РЎвЂњР В Р Р‹Р Р†Р вЂљРЎв„ўР В Р’В Р РЋРІР‚СћР В Р Р‹Р Р†Р вЂљРЎв„ўР В Р’В Р РЋРІР‚СћР В Р’В Р РЋРїС—Р…Р В Р’В Р вЂ™Р’ВµР В Р Р‹Р В РІР‚С™
//							{
//							/*   if(channels[RecieveBuf[6+index]].settings.set.state_byte_1!=RecieveBuf[6+index+2])
//							   {
//							   		channels[RecieveBuf[6+index]].settings.set.state_byte_1=RecieveBuf[6+index+2];
//									store_data=1;
//							   }*/
//							}
//							break;

							case CHNL_DEV_STATE://
							{
								switch((RecieveBuf[6+index+1])&0xF)
								{
									case CHNL_DEV_STATE_GET:
									{

